
#==========================================================================================#
# >>>>> ПОДКЛЮЧЕНИЕ БИБЛИОТЕК И МОДУЛЕЙ <<<<< #
#==========================================================================================#

from celery import Celery


import os

#==========================================================================================#
# >>>>> СОЗДАНИЕ ПРИЛОЖЕНИЯ CELERY  <<<<< #
#==========================================================================================#

os.environ.setdefault("DJANGO_SETTINGS_MODULE", "OrderQueue.settings")
app = Celery("OrderQueue")
app.config_from_object("django.conf:settings", namespace="CELERY")
app.autodiscover_tasks()
