
#==========================================================================================#
# >>>>> ПОДКЛЮЧЕНИЕ БИБЛИОТЕК И МОДУЛЕЙ <<<<< #
#==========================================================================================#

from dublib.Methods import ReadJSON, WriteJSON

#==========================================================================================#
# >>>>> ЗАПИСЬ ПИЦЦ В JSON-ФОРМАТ <<<<< #
#==========================================================================================#

# Запись словаря меню в JSON.
def InfoPizzasWrite(InfoPizzas):
    WriteJSON('Json/InfoPizzas.json', InfoPizzas)

#==========================================================================================#
# >>>>> ЗАПИСЬ ЗАКАЗОВ В JSON-ФОРМАТ <<<<< #
#==========================================================================================#

# Запись словаря корзины в JSON.
def InfoOrdersWrite(InfoOrders):
    WriteJSON('Json/InfoOrders.json', InfoOrders)

#==========================================================================================#
# >>>>> ЗАПИСЬ ПИЦЦ В ФОРМАТ СЛОВАРЯ <<<<< #
#==========================================================================================#

# Чтение словаря меню в JSON.
def InfoPizzasRead():
    InfoPizzas = ReadJSON('Json\InfoPizzas.json')

    return InfoPizzas

#==========================================================================================#
# >>>>> ЗАПИСЬ ЗАКАЗОВ В ФОРМАТ СЛОВАРЯ <<<<< #
#==========================================================================================#

# Чтение словаря корзины в JSON.
def InfoOrdersRead():
    InfoOrders = ReadJSON('Json\InfoOrders.json')

    return InfoOrders




    