
#==========================================================================================#
# >>>>> ПОДКЛЮЧЕНИЕ БИБЛИОТЕК И МОДУЛЕЙ <<<<< #
#==========================================================================================#

from dublib.Methods import ReadJSON
from telethon import functions
from telethon import TelegramClient
from telethon.tl.functions.contacts import ImportContactsRequest
from telethon.tl.types import InputPhoneContact

#==========================================================================================#
# >>>>> ЧТЕНИЕ НАСТРОЕК <<<<< #
#==========================================================================================#

Settings = ReadJSON("Source\Settings.json")

#==========================================================================================#
# >>>>> ОТПРАВКА УВЕДОМЛЕНИЙ <<<<< #
#==========================================================================================#

def TelegramNotifications():

    #==========================================================================================#
    # >>>>> НАСТРОЙКА ТЕЛЕГРАММ КЛИЕНТА <<<<< #
    #==========================================================================================#

    with TelegramClient('anon', Settings["api_id"], Settings["api_hash"]) as client:
       
        #==========================================================================================#
        # >>>>> НАСТРОЙКА ТЕЛЕГРАММ КЛИЕНТА <<<<< #
        #==========================================================================================#
        async def mavin():
            # Создание данных контакта.
            contact = InputPhoneContact(client_id=0, phone='+37529*******', first_name="Уведомление", last_name="Отправлено")
            # Добавление контакта.
            contacts = await client(ImportContactsRequest([contact]))
            # Отправка уведомления по номеру телефона.
            await client.send_message('+37529*******', 'Hello, friend!')
            # Удаление контакта.
            await client(functions.contacts.DeleteContactsRequest([contacts.users[0]]))
        
        client.loop.run_until_complete(mavin())
   
TelegramNotifications()
     